; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-78)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 - object)
 (:init 
    (arm-empty)
    (clear b21)
    (on b21 b16)
    (on b16 b9)
    (on b9 b8)
    (on b8 b15)
    (on b15 b20)
    (on b20 b18)
    (on-table b18)
    (clear b13)
    (on b13 b7)
    (on b7 b2)
    (on b2 b22)
    (on b22 b14)
    (on b14 b6)
    (on b6 b3)
    (on b3 b5)
    (on b5 b11)
    (on b11 b17)
    (on b17 b10)
    (on b10 b1)
    (on b1 b4)
    (on b4 b23)
    (on b23 b12)
    (on b12 b19)
    (on-table b19))
 (:goal (and 
(clear b13) (on b13 b20)
))
)

; plan
1. (unstack b21 b16)
   deleted: (on b21 b16) (clear b21) (arm-empty)
   added: (holding b21) (clear b16)
   goals met: 1 of 2
2. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 2
3. (unstack b16 b9)
   deleted: (on b16 b9) (clear b16) (arm-empty)
   added: (holding b16) (clear b9)
   goals met: 1 of 2
4. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 2
5. (unstack b9 b8)
   deleted: (on b9 b8) (clear b9) (arm-empty)
   added: (holding b9) (clear b8)
   goals met: 1 of 2
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 2
7. (unstack b8 b15)
   deleted: (on b8 b15) (clear b8) (arm-empty)
   added: (holding b8) (clear b15)
   goals met: 1 of 2
8. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 2
9. (unstack b15 b20)
   deleted: (on b15 b20) (clear b15) (arm-empty)
   added: (holding b15) (clear b20)
   goals met: 1 of 2
10. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 2
11. (unstack b13 b7)
   deleted: (on b13 b7) (clear b13) (arm-empty)
   added: (holding b13) (clear b7)
   goals met: 0 of 2
12. (stack b13 b20)
   deleted: (clear b20) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b20)
   goals met: 2 of 2
